xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_ll_lpuart.h
/**
  ******************************************************************************
  * @file    py32l090_ll_lpuart.h
  * @author  MCU Application Team
  * @brief   Header file of LPUART LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32L090_LL_LPUART_H
#define PY32L090_LL_LPUART_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32l0xx.h"

/** @addtogroup PY32L090_LL_Driver
  * @{
  */

#if defined (LPUART1)

/** @defgroup LPUART_LL LPUART
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup LPUART_LL_Private_Variables LPUART Private Variables
  * @{
  */
/* Array used to get the LPUART prescaler division decimal values versus @ref LPUART_LL_EC_PRESCALER values */
static const uint16_t LPUART_PRESCALER_TAB[] =
{
  (uint16_t)1,
  (uint16_t)2,
  (uint16_t)4,
  (uint16_t)6,
  (uint16_t)8,
  (uint16_t)10,
  (uint16_t)12,
  (uint16_t)16,
  (uint16_t)32,
  (uint16_t)64,
  (uint16_t)128,
  (uint16_t)256
};
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup LPUART_LL_Private_Constants LPUART Private Constants
  * @{
  */
/* Defines used in Baud Rate related macros and corresponding register setting computation */
#define LPUART_LPUARTDIV_FREQ_MUL     256U
#define LPUART_BRR_MASK               0x000FFFFFU
#define LPUART_BRR_MIN_VALUE          0x00000300U
/**
  * @}
  */


/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup LPUART_LL_Private_Macros LPUART Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup LPUART_LL_ES_INIT LPUART Exported Init structures
  * @{
  */

/**
  * @brief LL LPUART Init Structure definition
  */
typedef struct
{
  uint32_t PrescalerValue;            /*!< Specifies the Prescaler to compute the communication baud rate.
                                           This parameter can be a value of @ref LPUART_LL_EC_PRESCALER.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetPrescaler().*/

  uint32_t BaudRate;                  /*!< This field defines expected LPUART communication baud rate.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetBaudRate().*/

  uint32_t DataWidth;                 /*!< Specifies the number of data bits transmitted or received in a frame.
                                           This parameter can be a value of @ref LPUART_LL_EC_DATAWIDTH.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetDataWidth().*/

  uint32_t StopBits;                  /*!< Specifies the number of stop bits transmitted.
                                           This parameter can be a value of @ref LPUART_LL_EC_STOPBITS.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetStopBitsLength().*/

  uint32_t Parity;                    /*!< Specifies the parity mode.
                                           This parameter can be a value of @ref LPUART_LL_EC_PARITY.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetParity().*/

  uint32_t TransferDirection;         /*!< Specifies whether the Receive and/or Transmit mode is enabled or disabled.
                                           This parameter can be a value of @ref LPUART_LL_EC_DIRECTION.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetTransferDirection().*/

  uint32_t HardwareFlowControl;       /*!< Specifies whether the hardware flow control mode is enabled or disabled.
                                           This parameter can be a value of @ref LPUART_LL_EC_HWCONTROL.

                                           This feature can be modified afterwards using unitary
                                           function @ref LL_LPUART_SetHWFlowCtrl().*/

} LL_LPUART_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup LPUART_LL_Exported_Constants LPUART Exported Constants
  * @{
  */

/** @defgroup LPUART_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_LPUART_WriteReg function
  * @{
  */
#define LL_LPUART_ICR_PECF                 LPUART_ICR_PECF                /*!< Parity error flag */
#define LL_LPUART_ICR_FECF                 LPUART_ICR_FECF                /*!< Framing error flag */
#define LL_LPUART_ICR_NCF                  LPUART_ICR_NECF                /*!< Noise error detected flag */
#define LL_LPUART_ICR_ORECF                LPUART_ICR_ORECF               /*!< Overrun error flag */
#define LL_LPUART_ICR_IDLECF               LPUART_ICR_IDLECF              /*!< Idle line detected flag */
#define LL_LPUART_ICR_TCCF                 LPUART_ICR_TCCF                /*!< Transmission complete flag */
#define LL_LPUART_ICR_CTSCF                LPUART_ICR_CTSCF               /*!< CTS flag */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_LPUART_ReadReg function
  * @{
  */
#define LL_LPUART_ISR_PE                   LPUART_ISR_PE                  /*!< Parity error flag */
#define LL_LPUART_ISR_FE                   LPUART_ISR_FE                  /*!< Framing error flag */
#define LL_LPUART_ISR_NE                   LPUART_ISR_NE                  /*!< Noise detected flag */
#define LL_LPUART_ISR_ORE                  LPUART_ISR_ORE                 /*!< Overrun error flag */
#define LL_LPUART_ISR_IDLE                 LPUART_ISR_IDLE                /*!< Idle line detected flag */
#define LL_LPUART_ISR_RXNE                 LPUART_ISR_RXNE                /*!< Read data register not empty flag */
#define LL_LPUART_ISR_TC                   LPUART_ISR_TC                  /*!< Transmission complete flag */
#define LL_LPUART_ISR_TXE                  LPUART_ISR_TXE                 /*!< Transmit data register empty flag*/
#define LL_LPUART_ISR_CTSIF                LPUART_ISR_CTSIF               /*!< CTS interrupt flag */
#define LL_LPUART_ISR_CTS                  LPUART_ISR_CTS                 /*!< CTS flag */
#define LL_LPUART_ISR_BUSY                 LPUART_ISR_BUSY                /*!< Busy flag */
#define LL_LPUART_ISR_CMF                  LPUART_ISR_CMF                 /*!< Character match flag */
#define LL_LPUART_ISR_SBKF                 LPUART_ISR_SBKF                /*!< Send break flag */
#define LL_LPUART_ISR_RWU                  LPUART_ISR_RWU                 /*!< Receiver wakeup from Mute mode flag */
#define LL_LPUART_ISR_WUF                  LPUART_ISR_WUF                 /*!< Wakeup from Stop mode flag */
#define LL_LPUART_ISR_TEACK                LPUART_ISR_TEACK               /*!< Transmit enable acknowledge flag */
#define LL_LPUART_ISR_REACK                LPUART_ISR_REACK               /*!< Receive enable acknowledge flag */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_LPUART_ReadReg and  LL_LPUART_WriteReg functions
  * @{
  */
#define LL_LPUART_CR1_IDLEIE               LPUART_CR1_IDLEIE              /*!< IDLE interrupt enable */
#define LL_LPUART_CR1_RXNEIE               LPUART_CR1_RXNEIE              /*!< Read data register interrupt enable */
#define LL_LPUART_CR1_TCIE                 LPUART_CR1_TCIE                /*!< Transmission complete interrupt enable */
#define LL_LPUART_CR1_TXEIE                LPUART_CR1_TXEIE               /*!< Transmit data register empty interrupt enable */
#define LL_LPUART_CR1_PEIE                 LPUART_CR1_PEIE                /*!< Parity error */
#define LL_LPUART_CR1_CMIE                 LPUART_CR1_CMIE                /*!< Character match interrupt enable */
#define LL_LPUART_CR3_EIE                  LPUART_CR3_EIE                 /*!< Error interrupt enable */
#define LL_LPUART_CR3_CTSIE                LPUART_CR3_CTSIE               /*!< CTS interrupt enable */
#define LL_LPUART_CR3_WUFIE                LPUART_CR3_WUFIE               /*!< Wakeup from Stop mode interrupt enable */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_DIRECTION Direction
  * @{
  */
#define LL_LPUART_DIRECTION_NONE           0x00000000U                        /*!< Transmitter and Receiver are disabled */
#define LL_LPUART_DIRECTION_RX             LPUART_CR1_RE                      /*!< Transmitter is disabled and Receiver is enabled */
#define LL_LPUART_DIRECTION_TX             LPUART_CR1_TE                      /*!< Transmitter is enabled and Receiver is disabled */
#define LL_LPUART_DIRECTION_TX_RX          (LPUART_CR1_TE |LPUART_CR1_RE)     /*!< Transmitter and Receiver are enabled */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_PARITY Parity Control
  * @{
  */
#define LL_LPUART_PARITY_NONE              0x00000000U                        /*!< Parity control disabled */
#define LL_LPUART_PARITY_EVEN              LPUART_CR1_PCE                     /*!< Parity control enabled and Even Parity is selected */
#define LL_LPUART_PARITY_ODD               (LPUART_CR1_PCE | LPUART_CR1_PS)   /*!< Parity control enabled and Odd Parity is selected */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_WAKEUP Wakeup
  * @{
  */
#define LL_LPUART_WAKEUP_IDLELINE          0x00000000U                        /*!<  LPUART wake up from Mute mode on Idle Line */
#define LL_LPUART_WAKEUP_ADDRESSMARK       LPUART_CR1_WAKE                    /*!<  LPUART wake up from Mute mode on Address Mark */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_DATAWIDTH Datawidth
  * @{
  */
#define LL_LPUART_DATAWIDTH_7B             LPUART_CR1_M1                       /*!< 7 bits word length : Start bit, 7 data bits, n stop bits */
#define LL_LPUART_DATAWIDTH_8B             0x00000000U                         /*!< 8 bits word length : Start bit, 8 data bits, n stop bits */
#define LL_LPUART_DATAWIDTH_9B             LPUART_CR1_M0                       /*!< 9 bits word length : Start bit, 9 data bits, n stop bits */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_PRESCALER Clock Source Prescaler
  * @{
  */
#define LL_LPUART_PRESCALER_DIV1            0x00000000U                                                                     /*!< Input clock not divided   */
#define LL_LPUART_PRESCALER_DIV2           (LPUART_PRESC_PRESCALER_0)                                                       /*!< Input clock divided by 2  */
#define LL_LPUART_PRESCALER_DIV4           (LPUART_PRESC_PRESCALER_1)                                                       /*!< Input clock divided by 4  */
#define LL_LPUART_PRESCALER_DIV6           (LPUART_PRESC_PRESCALER_1 | LPUART_PRESC_PRESCALER_0)                            /*!< Input clock divided by 6  */
#define LL_LPUART_PRESCALER_DIV8           (LPUART_PRESC_PRESCALER_2)                                                       /*!< Input clock divided by 8  */
#define LL_LPUART_PRESCALER_DIV10          (LPUART_PRESC_PRESCALER_2 | LPUART_PRESC_PRESCALER_0)                            /*!< Input clock divided by 10 */
#define LL_LPUART_PRESCALER_DIV12          (LPUART_PRESC_PRESCALER_2 | LPUART_PRESC_PRESCALER_1)                            /*!< Input clock divided by 12 */
#define LL_LPUART_PRESCALER_DIV16          (LPUART_PRESC_PRESCALER_2 | LPUART_PRESC_PRESCALER_1 | LPUART_PRESC_PRESCALER_0) /*!< Input clock divided by 16 */
#define LL_LPUART_PRESCALER_DIV32          (LPUART_PRESC_PRESCALER_3)                                                       /*!< Input clock divided by 32 */
#define LL_LPUART_PRESCALER_DIV64          (LPUART_PRESC_PRESCALER_3 | LPUART_PRESC_PRESCALER_0)                            /*!< Input clock divided by 64 */
#define LL_LPUART_PRESCALER_DIV128         (LPUART_PRESC_PRESCALER_3 | LPUART_PRESC_PRESCALER_1)                            /*!< Input clock divided by 128 */
#define LL_LPUART_PRESCALER_DIV256         (LPUART_PRESC_PRESCALER_3 | LPUART_PRESC_PRESCALER_1 | LPUART_PRESC_PRESCALER_0) /*!< Input clock divided by 256 */
/**
  * @}
  */

